// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Deze software moet op het opstartvolume geïnstalleerd worden.";
"ERROR_INSTALL" = "Dit volume voldoet niet aan de eisen voor deze update.";

"Newer_Package_Installed_message" = "Een nieuwere versie van Chameleon is al geïnstalleerd.";
"Intel_Mac_message" = "Deze software kan niet worden geïnstalleerd op deze computer.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon heeft drie essentiële bestanden nodig(Simpel gezegd).
boot0 (Op het MBR van de harde schijf) Verantwoordelijke voor het laden van boot1.
boot1 (Op de boot-sector van de partitie) Om boot2 te vinden.
boot2 (In de root van de partitie) Om de kernel, etc. te laden .";

"Standard_title" = "Chameleon Standaard";
"Standard_description" = "Installeer Chameleon";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Geen";
"noboot_description" = "Installeer Chameleon niet. (Bruikbaar om alleen Extra onderelen te installeren)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file. ";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "This module permits the user to define the keyboard key mappings.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Hulpprogramma";
"Utility_description" = "Optionele bestanden om te helpen installeren.";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Installeerd het Preference Panel voor Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Kopieert een voorbeeld smbios.plist naar /Extra/Configuration.";

"Documentation_title" = "Documentatie";
"Documentation_description" = "Documentatie voor de handmatige installatie en het gebruik van Chameleon.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opties";
"Options_description" = "Stel standaard opties in";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Verbergt Chameleon's boot banner in de GUI.";

"GUI_title" = "GUI";
"GUI_description" = "Om de grafische interface uit te zetten, moet er GUI=n aan com.apple.Boot.plist toegevoegd worden."

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Gebruik het legacy logo (grijs op wit) op het bootscherm in plaats van het boot.png logo van het thema.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Geef het partitie selectie scherm weer, zonder het timeout scherm weer te geven.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Schakelt quit boot mode in(geen berichten of prompt).";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Disables display of partition and resolution details shown on the left side of the GUI under the boot banner. This is useful information for troubleshooting, though can clash with certain themes.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pauzeert het boot process nadat Chameleon's setup voltooid is, hierna wacht het tot er op een toets gedrukt wordt voor het de mach kernel start. Bruikbaar wanneer het gecombineerd wordt met de verbose boot voor probleemoplossing.";

"SkipFTFix_title" = "SkipFTFix=Yes";
"SkipFTFix_description" = "A temporary work around for this breaking RAID booting.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Boot de kernel in 32bit mode in plaats van de standaard 64bit mode.";

"ForceHPET_title" = "ForceHPET";
"ForceHPET_description" = "Voeg ForceHPET=y toe aan com.apple.Boot.plist, Deze optie zorgt ervoor dat HPET aangezet wordt op intel chipsets en is voor biossen die die optie niet ondersteunen.";

"ForceWake_title" = "ForceWake";
"ForceWake_description" = "Voeg ForceWake=y toe aan com.apple.Boot.plist, deze optie zorgt ervoor dat je corrupte sleep images kan voorbijgaan.";

"EHCIacquire_title" = "EHCIacquire";
"EHCIacquire_description" = "Voeg EHCIacquire=y toe aan com.apple.Boot.plist, Deze optie repareert alle EHCI ownership problemen die worden veroorzaakt door slechte biossen.";

"UHCIreset_title" = "UHCIreset";
"UHCIreset_description" = "Voeg UHCIreset=y toe aan com.apple.Boot.plist, Deze optie zal UHCI controllers resetten voor dat OS X gestart wordt.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Schakelt de automatisch ingeschakelde restart fix uit.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Enables the option to reset UHCI controllers before starting OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Schakelt de automatisch ingeschakelde RAM geheugen herkenning uit.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "For Lion only. Enables loading of the pre-linked kernel. This will ignore /E/E and /S/L/E. ONLY use this is you have know it contains everything you need.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Probeert de sleep image te laden die opgeslagen is van de laatste keer dat de pc in hibernation is gezet.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Negeert de SSDT tables die ingebouwd zitten in het moederbord.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable specific Processor power state, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable specific Processor power state, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable specific Processor power state, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Schakel automatisch gegenereerde processor C-States in.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Schakel automatisch gegenereerde processor P-States in.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Enables the option to autodetect NVIDIA based GPUs and inject the correct info.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Schakelt UseAtiROM opties in.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Schakelt UseNvidiaROM opties in.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Schakelt VBIOS optie in.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "For overcoming a hang at 'PCI configuration begin' on some systems. 0x2000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Use the keyboard layout for a German Mac keyboard";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Use the keyboard layout for a Spanish Mac keyboard";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Use the keyboard layout for a French Mac keyboard";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Use the keyboard layout for an Italian Mac keyboard";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Use the keyboard layout for a Swedish Mac keyboard";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Use the keyboard layout for a French PC keyboard";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Een kleinere simpele versie van het nieuwe standaard thema dat gebruikt wordt, wanneer er een versie van Chameleon gebouwd wordt die een geëmbed thema nodig heeft.";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's vorige default thema";

"Default_title" = "Standaard";
"Default_description" = "Het thema wat geëmbed is in de booter, zodat deze aangepast kan worden.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Het Bullet thema door NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Resolution";
"Resolution_description" = "Stel de schermresolutie van je monitor in";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Set one keylayout to use, or select 'None' if you don't want to select a keylayout.";

// Themes
"Themes_title" = "Thema's";
"Themes_description" = "Een Collectie van Voorbeeld Thema's
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
